---
kind: other
id: Methods.T:Autodesk.Revit.DB.FreeFormElement
source: html/f43ce066-cef3-d147-b4b6-6148f9ec1378.htm
---
# FreeFormElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.